In [26]:
import sqlite3
import pandas as pd

In [27]:
animals = pd.read_csv("animals_fixed.csv")

In [3]:
# Fix the incorrect region labels
animals["region"] = animals["region"].replace({
    "animal found the Americas": "animal found in the Americas",
    "animal found Eurasia": "animal found in Eurasia",
    "animal found Oceania": "animal found in Oceania",
    "animal found Africa": "animal found in Africa"
})

In [28]:
# Create a connection to an in-memory SQLite database
conn = sqlite3.connect(":memory:")

# Write the DataFrame to the database as a table
animals.to_sql("animals", conn, index=False, if_exists="replace")

1081

In [5]:
animals.head()

,domesticated,diet,habitat,Kingdom,region,subtype,species
0,wild animal,omnivore,terrestrial animal,mammal,animal found in Oceania,marsupial,bandicoot
1,wild animal,omnivore,terrestrial animal,mammal,animal found in the Americas,marsupial,flying squirrel
2,wild animal,omnivore,terrestrial animal,mammal,animal found in Eurasia,marsupial,flying squirrel
3,wild animal,herbivore,terrestrial animal,mammal,animal found in Oceania,marsupial,kangaroo
4,wild animal,herbivore,terrestrial animal,mammal,animal found in Oceania,marsupial,koala bear

In [10]:
query = """
SELECT *
FROM animals

UNION ALL

SELECT domesticated, diet, habitat, Kingdom, 'animal found in Eurasia' AS region, subtype, species 
FROM animals
WHERE region = 'animal found worldwide'

UNION ALL

SELECT domesticated, diet, habitat, Kingdom, 'animal found in Africa' AS region, subtype, species
FROM animals
WHERE region = 'animal found worldwide'

UNION ALL

SELECT domesticated, diet, habitat, Kingdom, 'animal found in Oceania' AS region, subtype, species
FROM animals
WHERE region = 'animal found worldwide'

UNION ALL

SELECT domesticated, diet, habitat, Kingdom,  'animal found in the Americas' AS location, subtype, species
FROM animals
WHERE region = 'animal found worldwide';
"""

# Run the query and return the result as a DataFrame
result_df = pd.read_sql_query(query, conn)
worldwide_animals = result_df.loc[result_df['domesticated']=='domesticated animal']
worldwide_animals.head()

,domesticated,diet,habitat,Kingdom,region,subtype,species
20,domesticated animal,herbivore,terrestrial animal,mammal,animal found in Africa,animal with horns antlers or tusks,buffalo
21,domesticated animal,herbivore,terrestrial animal,mammal,animal found in the Americas,animal with horns antlers or tusks,buffalo
24,domesticated animal,herbivore,terrestrial animal,mammal,animal found worldwide,animal with horns antlers or tusks,cow
25,domesticated animal,herbivore,terrestrial animal,mammal,animal found worldwide,animal with spots,cow
26,domesticated animal,herbivore,terrestrial animal,mammal,animal found in Eurasia,animal with horns antlers or tusks,cow

In [19]:
query="""
SELECT * 
FROM animals

UNION ALL

SELECT domesticated, 'carnivore' AS diet, habitat, Kingdom, region, subtype, species
FROM animals
WHERE species = 'pet dog'
"""

# Run the query and return the result as a DataFrame
result_df = pd.read_sql_query(query, conn)
worldwide_animals = result_df.loc[result_df['species']=='pet dog']
worldwide_animals.head(10)

,domesticated,diet,habitat,Kingdom,region,subtype,species
245,domesticated animal,omnivore,terrestrial animal,mammal,animal found worldwide,canine,pet dog
582,domesticated animal,omnivore,terrestrial animal,mammal,animal found in Eurasia,canine,pet dog
714,domesticated animal,omnivore,terrestrial animal,mammal,animal found in Africa,canine,pet dog
846,domesticated animal,omnivore,terrestrial animal,mammal,animal found in Oceania,canine,pet dog
978,domesticated animal,omnivore,terrestrial animal,mammal,animal found in the Americas,canine,pet dog
1074,domesticated animal,carnivore,terrestrial animal,mammal,animal found worldwide,canine,pet dog
1075,domesticated animal,carnivore,terrestrial animal,mammal,animal found in Eurasia,canine,pet dog
1076,domesticated animal,carnivore,terrestrial animal,mammal,animal found in Africa,canine,pet dog
1077,domesticated animal,carnivore,terrestrial animal,mammal,animal found in Oceania,canine,pet dog
1078,domesticated animal,carnivore,terrestrial animal,mammal,animal found in the Americas,canine,pet dog

In [24]:
query="""
SELECT * 
FROM animals

UNION ALL

SELECT domesticated, diet, habitat, Kingdom, region, 'animal with stripes' as subtype, species
FROM animals
WHERE species = 'hyena'
"""

# Run the query and return the result as a DataFrame
result_df = pd.read_sql_query(query, conn)
worldwide_animals = result_df.loc[result_df['species']=='hyena']
worldwide_animals.head(10)

,domesticated,diet,habitat,Kingdom,region,subtype,species
241,wild animal,carnivore,terrestrial animal,mammal,animal found in Africa,None,hyena
242,wild animal,carnivore,terrestrial animal,mammal,animal found in Eurasia,None,hyena
1079,wild animal,carnivore,terrestrial animal,mammal,animal found in Africa,animal with stripes,hyena
1080,wild animal,carnivore,terrestrial animal,mammal,animal found in Eurasia,animal with stripes,hyena

In [34]:
query="""
UPDATE animals
SET subtype = NULL
WHERE subtype = 'animal with spots';

UPDATE animals
SET subtype = NULL
WHERE subtype = 'animal with stripes';
"""

# Run the query and return the result as a DataFrame
conn.executescript(query)
# Read the updated data into a DataFrame
result_df = pd.read_sql_query("SELECT * FROM animals", conn)

# Show the updated DataFrame
result_df.head()
worldwide_animals = result_df.loc[result_df['subtype']=='animal with spots']
worldwide_animals.head(10)

Empty DataFrame
Columns: [domesticated, diet, habitat, Kingdom, region, subtype, species]
Index: []

In [35]:
result_df.to_csv('animals_fixed.csv',index=False)